RuPingCen/mick_robot_chasiss/User/stm32f10x_pwm/stm32f10x_pwm.c
			    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;	    //配置为PWM模式1
			
          if(u16channel == PWM_Channel_0)
					{              
						 	/* GPIOB clock enable */
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); 
							/*GPIOB Configuration: TIM3 channel 1 and 2 as alternate function push-pull */
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOB, &GPIO_InitStructure);
						
						  
						
						TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;	
						TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
						TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;  //当定时器计数值小于CCR1_Val时为高电平
						TIM_OC1Init(TIM4, &TIM_OCInitStructure);	 //使能通道1
						TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
          }
					else if(u16channel == PWM_Channel_1)
					{
               
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); 
							 
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_7 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOB, &GPIO_InitStructure);
													/* PWM1 Mode configuration: Channel2 */
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	  //设置通道2的电平跳变值，输出另外一个占空比的PWM
							TIM_OC2Init(TIM4, &TIM_OCInitStructure);	  //使能通道2
							TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
          }
					else if(u16channel == PWM_Channel_2)
					{
               
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); 
							 
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_8 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOB, &GPIO_InitStructure);
						
											 
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道3的电平跳变值，输出另外一个占空比的PWM
							TIM_OC3Init(TIM4, &TIM_OCInitStructure);	  
							TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);
						
          }
					else if(u16channel == PWM_Channel_3)
					{
              
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); 
							 
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_9 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOB, &GPIO_InitStructure);
						  
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道4的电平跳变值，输出另外一个占空比的PWM
							TIM_OC4Init(TIM4, &TIM_OCInitStructure);	 
							TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);
							TIM_ARRPreloadConfig(TIM4, ENABLE);			 // 使能TIM4重载寄存器ARR
          }
					else  
					{
              while(1);//初始化错误
          }
  
					TIM_Cmd(TIM4, ENABLE);                   //使能定时器4	
    }
		else if(u8PWMx == PWM3) //使用定时器2输出比较功能
		{
          RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE); /* 设置TIM3CLK 为 72MHZ */
          TIM_TimeBaseStructure.TIM_Period = u32period-1;       //当定时器从0计数到999，即为1000次，为一个定时周期
					TIM_TimeBaseStructure.TIM_Prescaler = 71;	    //设置预分频：不预分频，即为72MHz
					TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1 ;	//设置时钟分频系数：不分频(这里用不到)
					TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  //向上计数模式
					TIM_TimeBaseInit( TIM2, &TIM_TimeBaseStructure);
			 
			    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;	    //配置为PWM模式1
			
          if(u16channel == PWM_Channel_0)
					{              
						 	/* GPIOA clock enable */
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); 
							/*GPIOA Configuration: TIM3 channel 1 and 2 as alternate function push-pull */
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_0 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOA, &GPIO_InitStructure);
						
						  
						
						TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;	
						TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
						TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;  //当定时器计数值小于CCR1_Val时为高电平
						TIM_OC1Init(TIM2, &TIM_OCInitStructure);	 //使能通道1
						TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);
          }
					else if(u16channel == PWM_Channel_1)
					{
               /* GPIOA clock enable */
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); 
							/*GPIOA Configuration: TIM3 channel 1 and 2 as alternate function push-pull */
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_1 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOA, &GPIO_InitStructure);
													/* PWM1 Mode configuration: Channel2 */
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	  //设置通道2的电平跳变值，输出另外一个占空比的PWM
							TIM_OC2Init(TIM2, &TIM_OCInitStructure);	  //使能通道2
							TIM_OC2PreloadConfig(TIM2, TIM_OCPreload_Enable);
          }
					else if(u16channel == PWM_Channel_2)
					{
              /*  GPIOB clock enable */
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); 
							/*GPIOA Configuration: TIM3 channel 1 and 2 as alternate function push-pull */
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_2 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOA, &GPIO_InitStructure);
						
											/* PWM1 Mode configuration: Channel3 */
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道3的电平跳变值，输出另外一个占空比的PWM
							TIM_OC3Init(TIM2, &TIM_OCInitStructure);	 //使能通道3
							TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);
						
