RuPingCen/mick_robot_chasiss/User/stm32f10x_pwm/stm32f10x_pwm.c
          }
					else if(u16channel == PWM_Channel_3)
					{
              /*  GPIOB clock enable */
							RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); 
							/*GPIOA Configuration: TIM3 channel 1 and 2 as alternate function push-pull */
							GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_3 ;
							GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;		    // 复用推挽输出
							GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
							GPIO_Init(GPIOA, &GPIO_InitStructure);
						 
						 					/* PWM1 Mode configuration: Channel4 */
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道4的电平跳变值，输出另外一个占空比的PWM
							TIM_OC4Init(TIM2, &TIM_OCInitStructure);	//使能通道4
							TIM_OC4PreloadConfig(TIM2, TIM_OCPreload_Enable);
							//TIM_ARRPreloadConfig(TIM1, ENABLE);			 // 使能TIM3重载寄存器ARR
          }
					else  
					{
              while(1);//初始化错误
          }
  
					TIM_Cmd(TIM2, ENABLE);                   //使能定时器1	
    }
		else  
		{
       while(1);  
    }
}
/*************************************************************************
*  函数名称： PWM_Duty_Change
*  功能说明： STM32 pwm 占空比改变函数
*  参数说明： u8PWMx (PWM1 PWM2 PWM3)  
*             u16channel ( PWM_Channel_x 0、1、2、3 )
*             u32period  PWm周期参数  这里的参数必须与初始化PWm的周期一致  
*                                      这里只是为了计算占空比的时候方便  所以再传入一次
*             u16duty ( 1 ~ 1000) PWM占空比参数  输出占空比 = u16duty/1000 * 100%
*
*  函数返回： 无
*  修改时间： 2014-11-2
*  备    注： CRP   
*************************************************************************/
void PWM_Duty_Change(u8 u8PWMx,u16 u16channel , u32 u32period, u16 u16duty)
{
	  
//	    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	    TIM_OCInitTypeDef  TIM_OCInitStructure; 
	
	     
    if(u8PWMx == PWM1) //使用定时器3输出比较功能
		{ 
			     TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;	    //配置为PWM模式1 
			   if(u16channel == PWM_Channel_0)
					{              
						 
						TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
						TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
						TIM_OC1Init(TIM3, &TIM_OCInitStructure);	 //使能通道1
						TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Enable);
						 	 
          }
					else if(u16channel == PWM_Channel_1)
					{
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	  //设置通道2的电平跳变值，输出另外一个占空比的PWM
							TIM_OC2Init(TIM3, &TIM_OCInitStructure);	  //使能通道2
							TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);
						   
          }
					else if(u16channel == PWM_Channel_2)
					{
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道3的电平跳变值，输出另外一个占空比的PWM
							TIM_OC3Init(TIM3, &TIM_OCInitStructure);	 //使能通道3
							TIM_OC3PreloadConfig(TIM3, TIM_OCPreload_Enable);
						
          }
					else if(u16channel == PWM_Channel_3)
					{
						  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道4的电平跳变值，输出另外一个占空比的PWM
							TIM_OC4Init(TIM3, &TIM_OCInitStructure);	//使能通道4
							TIM_OC4PreloadConfig(TIM3, TIM_OCPreload_Enable);
							 
          }
					else  
					{
              while(1);//初始化错误
          }
				 
		}
		else if(u8PWMx == PWM2) //使用定时器3输出比较功能
		{ 
			   TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;	    //配置为PWM模式1 
			   if(u16channel == PWM_Channel_0)
					{              
						 
						TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
						TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
						TIM_OC1Init(TIM4, &TIM_OCInitStructure);	 //使能通道1
						TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
						 	 
          }
					else if(u16channel == PWM_Channel_1)
					{
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	  //设置通道2的电平跳变值，输出另外一个占空比的PWM
							TIM_OC2Init(TIM4, &TIM_OCInitStructure);	  //使能通道2
							TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
						   
          }
					else if(u16channel == PWM_Channel_2)
					{
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道3的电平跳变值，输出另外一个占空比的PWM
							TIM_OC3Init(TIM4, &TIM_OCInitStructure);	 //使能通道3
							TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);
						
          }
					else if(u16channel == PWM_Channel_3)
					{
						  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道4的电平跳变值，输出另外一个占空比的PWM
							TIM_OC4Init(TIM4, &TIM_OCInitStructure);	//使能通道4
							TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);
							 
          }
					else  
					{
              while(1);//初始化错误
          }
		}
		else if(u8PWMx == PWM3) //使用定时器3输出比较功能
		{ 
			   TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;	    //配置为PWM模式1 
			   if(u16channel == PWM_Channel_0)
					{              
						 
						TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
						TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	   //设置跳变值，当计数器计数到这个值时，电平发生跳变
						TIM_OC1Init(TIM2, &TIM_OCInitStructure);	 //使能通道1
						TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);
						 	 
          }
					else if(u16channel == PWM_Channel_1)
					{
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	  //设置通道2的电平跳变值，输出另外一个占空比的PWM
							TIM_OC2Init(TIM2, &TIM_OCInitStructure);	  //使能通道2
							TIM_OC2PreloadConfig(TIM2, TIM_OCPreload_Enable);
						   
