RuPingCen/mick_robot_chasiss/User/stm32f10x_pwm/stm32f10x_pwm.c
          }
					else if(u16channel == PWM_Channel_2)
					{
							TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道3的电平跳变值，输出另外一个占空比的PWM
							TIM_OC3Init(TIM2, &TIM_OCInitStructure);	 //使能通道3
							TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);
						
          }
					else if(u16channel == PWM_Channel_3)
					{
						  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
							TIM_OCInitStructure.TIM_Pulse = ((u32period/100.0)*u16duty +0.5)/10;	//设置通道4的电平跳变值，输出另外一个占空比的PWM
							TIM_OC4Init(TIM2, &TIM_OCInitStructure);	//使能通道4
							TIM_OC4PreloadConfig(TIM2, TIM_OCPreload_Enable);
							 
          }
					else  
					{
              while(1);//初始化错误
          }
			
		}
		else 
			while(1);//初始化错误  


}


/*************************************************************************
功能：			配置定时器为外部计数模式

TIM4      外部计数引脚  PE0 （浮空输入模式）

TIM3      外部计数引脚  PD2  （浮空输入模式）

TIM1      外部计数引脚  PA12 （浮空输入模式）


步骤：
     1、设置定时器计数溢出值（周期） 预分频系数  计数模式    TCR1
		 2、设置SMCR  使能外部时钟
     3、设置中断		 
		 4、启动定时器 
*************************************************************************/
void Time4_ExternPulse_CountMode_Init(void)
{  
			GPIO_InitTypeDef GPIO_InitStructure;
			TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;	   
//			NVIC_InitTypeDef NVIC_InitStructure; 



			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);  
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE); 

			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 ;  
			GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;  
			GPIO_Init(GPIOE, &GPIO_InitStructure);            

			TIM_TimeBaseStructure.TIM_Prescaler = 0x00; 
			TIM_TimeBaseStructure.TIM_Period = 0xFFFF; 
			TIM_TimeBaseStructure.TIM_ClockDivision = 0x0; 
			TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; 
			TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);  // Time base configuration 

			TIM_ETRClockMode2Config(TIM4, TIM_ExtTRGPSC_OFF, TIM_ExtTRGPolarity_NonInverted, 0);  //  TIM4->SMCR=0x4000;   启动外部计数 上升沿有效  关闭预分频  不使用滤波
     

/*
			NVIC_InitStructure.NVIC_IRQChannel = TIM4; //需要使用时 启用     可以放在中断里看看是否计数溢出了
			NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; 
			NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;  
			NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;  
			NVIC_Init(&NVIC_InitStructure);
			TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);  
			
*/			
			
			TIM_SetCounter(TIM4, 0);    
			TIM_Cmd(TIM4, ENABLE); 
}

/*************************************************************************
 函数功能：输入捕捉脉冲的宽度
 
 使用TIM4     CH1~4      PB6、PB7、PB8、PB9
 
*************************************************************************/
void Time4_CaptureMode_Init(void)
{  
	   TIM_ICInitTypeDef TIM4_ICInitStructure; 
		 GPIO_InitTypeDef GPIO_InitStructure;  
     TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;  
     NVIC_InitTypeDef NVIC_InitStructure;  
       
     
     RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);      
     RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);  
       
    
     GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;  
     GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;  
     GPIO_Init(GPIOB, &GPIO_InitStructure);  
   
     
     TIM_TimeBaseStructure.TIM_Period = 0xffff;    //  
     TIM_TimeBaseStructure.TIM_Prescaler = 71; //  
     TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;//  
     TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; // 
     TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);    //  
       
      
     TIM4_ICInitStructure.TIM_Channel = TIM_Channel_1 ;  //    
     TIM4_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Rising;  //  
     TIM4_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;//  
     TIM4_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1; //   
     TIM4_ICInitStructure.TIM_ICFilter = 0x00;  //  
     TIM_ICInit(TIM4, &TIM4_ICInitStructure);  
		 
		 
		 TIM4_ICInitStructure.TIM_Channel = TIM_Channel_2 ;  //    
     TIM4_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Rising;  //  
     TIM4_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;//  
     TIM4_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1; //   
     TIM4_ICInitStructure.TIM_ICFilter = 0x00;  //  
     TIM_ICInit(TIM4, &TIM4_ICInitStructure);  
		 
		 
		 TIM4_ICInitStructure.TIM_Channel = TIM_Channel_3 ;  //    
     TIM4_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Rising;  //  
     TIM4_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;//  
     TIM4_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1; //   
     TIM4_ICInitStructure.TIM_ICFilter = 0x00;  //  
     TIM_ICInit(TIM4, &TIM4_ICInitStructure);  
		 
		 
		 
		 TIM4_ICInitStructure.TIM_Channel = TIM_Channel_4 ;  //    
     TIM4_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Rising;  //  
     TIM4_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;//  
     TIM4_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1; //   
     TIM4_ICInitStructure.TIM_ICFilter = 0x00;  //  
     TIM_ICInit(TIM4, &TIM4_ICInitStructure);  
       
      
     NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;    //  
     NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  // 
     NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0; //  
     NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;    //  
     NVIC_Init(&NVIC_InitStructure);    
       
     TIM_ClearITPendingBit(TIM4, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4|TIM_IT_Update);  
		 
     TIM_ITConfig(TIM4, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4, ENABLE);  
		 
     TIM_Cmd(TIM4, ENABLE); 
}
/*********************************************END OF FILE**********************/
